//Перевірка підключеного файлу скриптів
console.log('Підключено файл скриптів script.js')

//Визначення масиву товарів
let itemsArray = [
    'Газонокосарка 43',
    'Електричний тример 110',
    'Електрична газонокосарка 32',
    'Акумуляторний обприскувач 12 N'
]

//отримання елементук з індифікатором items
let itemsDiv = document.getElementById("items");

//Перевірка існування знайденого блоку
if (itemsDiv) {
    itemsArray.forEach((item)=>{
        console.log(item)
    })

} else {
    //Вивід повідомлення про не знайдений блок
    console.log('Блок товарів не знайдено')
}

//Виведення елементів відсортованого масиву 
itemsArray.sort().forEach((item)=>{
    console.log(index + '-й елемент:', item)
})